backup/frontend/views/site/index.php

		<div class="col-md-3 col-sm-6 col-xs-12">

<?php
$count = (new \yii\db\Query())
	->from('catalogfiles')
	->count();
---
SELECT COUNT(*) FROM `catalogfiles`

						   <!-- Kunjungan Anggota -->
						   <?php echo \inliscore\adminlte\widgets\SmallBox::widget([
								  'type'=>\inliscore\adminlte\widgets\SmallBox::TYPE_GRAY,
								  'head'=>\common\models\Memberguesses::find()->count(),
---
SELECT COUNT(*) FROM `memberguesses`