opac/controllers/DetailOpacController.php

SELECT * FROM `catalogs` WHERE `ID`='22557'
---
            //$similiarTitle = Yii::$app->db->createCommand(" SELECT ID,Title FROM catalogs WHERE MATCH (title) AGAINST ('".addslashes($judul[0])."' IN BOOLEAN MODE) and isopac=1 and ID !=".$catalogID." limit 5;")->queryall();
            //$similiarTitle = Yii::$app->db->createCommand(" SELECT ID,Title FROM catalogs WHERE title like '%".$judul[0]."%'  and isopac=1 and ID !=".$catalogID." limit 5;")->queryall();
            //$similiarTitle = Yii::$app->db->createCommand(" select levenshtein('".$judul[0]."',Title) as nilai, ID,Title from catalogs where  isopac=1 and ID !=".$catalogID." order by nilai desc limit 5")->queryall();
            $modelcite = Catalogs::findOne($catalogID);