opac/controllers/SiteController.php

function is_connected()
{
    $connected = @fsockopen("ip-api.com", 80);
                                        //website, port  (try 80 or 443)
    if ($connected){
        $is_conn = true; //action when connected
        fclose($connected);
    }else{
        $is_conn = false; //action in connection failure
    }
    return $is_conn;

}

if(is_connected())
{
          $ip = \common\components\OpacHelpers::getip();
        $client = new Client(['baseUrl' => 'http://ip-api.com/json/']);
		  $response = $client->get($ip)->send();

		  if ($response->isOk) {
              $data = json_decode($response->content, true);
              if(Yii::$app->config->get('IsHitCounterOpac') == '0'){
                  $check = OpacCounter::find()->where(['ip_address' => $data['query'], 'DATE(create_at)' => date('Y-m-d')])->count();
---
SELECT COUNT(*) FROM `opac_counter` WHERE (`ip_address`='192.168.1.59') AND (DATE(create_at)='2021-11-09')