keanggotaan/views/site/index.php

            <div class="col-md-3 col-sm-6 col-xs-12">

                <?php
                $count = (new \yii\db\Query())
                    ->from('collectionloanitems')
                    ->join('INNER JOIN', 'members', 'members.ID = collectionloanitems.member_id')
                    ->where(['members.MemberNo'=>Yii::$app->user->identity->NoAnggota])
                    ->count();
---
SELECT COUNT(*) FROM `collectionloanitems` INNER JOIN `members` ON members.ID = collectionloanitems.member_id WHERE `members`.`MemberNo`='0121102500001'

            <!-- <div class="col-md-3 col-sm-6 col-xs-12">

                <?php
                $count = (new \yii\db\Query())
                    ->from('bacaditempat')
                    ->join('INNER JOIN', 'members', 'members.ID = bacaditempat.member_id')
                    ->where(['members.MemberNo'=>Yii::$app->user->identity->NoAnggota])
                    ->count();
---
SELECT COUNT(*) FROM `bacaditempat` INNER JOIN `members` ON members.ID = bacaditempat.member_id WHERE `members`.`MemberNo`='0121102500001'

            <!-- <div class="col-md-3 col-sm-6 col-xs-12">

                <?php
                $count = (new \yii\db\Query())
                    ->from('pelanggaran')
                    ->join('INNER JOIN', 'members', 'members.ID = pelanggaran.member_id')
                    ->where(['members.MemberNo'=>Yii::$app->user->identity->NoAnggota])
                    ->count();
---
SELECT COUNT(*) FROM `pelanggaran` INNER JOIN `members` ON members.ID = pelanggaran.member_id WHERE `members`.`MemberNo`='0121102500001'