common/models/Users.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'IsActive' => self::STATUS_ACTIVE]);
---
SELECT * FROM `users` WHERE (`id`=33) AND (`IsActive`=1)