opac/views/layouts/main-sederhana.php

SELECT * FROM `refferenceitems` WHERE `Refference_id`=5
SELECT * FROM `refferenceitems` WHERE `Refference_id`=17
SELECT * FROM `refferenceitems` WHERE `Refference_id`=2
SELECT * FROM `worksheets`
---
$homeUrl=Yii::$app->homeUrl;
$base=Yii::$app->controller->route;
$dateNow = new \DateTime("now");
$bahasa = Refferenceitems::find()
    ->where(['Refference_id' => 5])
    ->all();
$bentukKarya = Refferenceitems::find()
    ->where(['Refference_id' => 17])
    ->all();
$targetPembaca = Refferenceitems::find()
    ->where(['Refference_id' => 2])
    ->all();
$Worksheets= OpacHelpers::sortWorksheets(Worksheets::find()->asArray()->all());

SELECT COUNT(*) FROM `opac_counter`
---
            if($checkOpacCounter !== 0){
          ?>
            <div class="col-xs-12 col-sm-12 col-md-12 mt-2 mt-sm-2">
              <p>Counter : <?=str_pad(\common\models\OpacCounter::find()->count(), 7, '0', STR_PAD_LEFT)?></p>