opac/views/layouts/main.php

SELECT * FROM `refferenceitems` WHERE `Refference_id`=5
SELECT * FROM `refferenceitems` WHERE `Refference_id`=17
SELECT * FROM `refferenceitems` WHERE `Refference_id`=2
SELECT * FROM `worksheets`
---
$homeUrl=Yii::$app->homeUrl;
$base=Yii::$app->controller->route;
$dateNow = new \DateTime("now");
$bahasa = Refferenceitems::find()
    ->where(['Refference_id' => 5])
    ->all();
$bentukKarya = Refferenceitems::find()
    ->where(['Refference_id' => 17])
    ->all();
$targetPembaca = Refferenceitems::find()
    ->where(['Refference_id' => 2])
    ->all();
$Worksheets= OpacHelpers::sortWorksheets(Worksheets::find()->asArray()->all());