frontend/views/site/index.php

		<div class="col-md-3 col-sm-6 col-xs-12">

<?php
$count = (new \yii\db\Query())
	->from('catalogfiles')
	->count();
---
SELECT COUNT(*) FROM `catalogfiles`


			</div>
			<div class="col-md-3 col-sm-6 col-xs-1">
						   <!-- Kunjungan Anggota -->
						   <?php echo \inliscore\adminlte\widgets\SmallBox::widget([
								  'type'=>\inliscore\adminlte\widgets\SmallBox::TYPE_GRAY,
								  'head'=>\common\models\Memberguesses::find()->count(),
								  'text'=>'Kunjungan Anggota',
								  'icon'=>'fa fa-users',
								  //'footer'=>'Detail <i class="fa fa-hand-o-right"></i>',
								  //'footer_link'=>'#'
							  ]);?>
---
SELECT COUNT(*) FROM `memberguesses`